{
    "recipes": [
        {
            "liked": false,
            "img": "/frambuesas_y_trufas_de_cava.jpg",
            "name": "Trufas de cava y frambuesa",
            "description": "Para 12 unidades\nDificultad: Fácil\nTiempo total 15 m\nElaboración 15 \n Reposo 1 h",
            "ingridientes": "Chocolate negro 70% de cacao\n100 g Nata líquida\n80 ml Cava\n30 ml Azúcar glasé\n25 g Mantequilla\n5 g Frambuesas deshidratadas\n25 g Cacao puro en polvo",
            "pasos": "Calentamos la nata junto al azúcar hasta que hierva. En un cuenco troceamos el chocolate y vertemos la nata caliente por encima mientras removemos con unas varillas para que el chocolate se deshaga completamente. Agregamos la mantequilla y el cava mezclamos totalmente. Vertemos la mezcla en una bandeja, echamos la frambuesa, removemos y refrigeramos hasta que la masa se haya endurecido (cuanta más delgada sea la superficie antes se enfría). Una vez tengamos la masa cuajada, hacemos bolitas de igual tamaño con una cuchara y damos forma de bolita perfecta con las manos, teniendo cuidado de no dar mucho calor a la masa. Por último rebozamos cada trufa en lo que prefiramos: cacao en polvo, virutas, bolitas de anís, etc. Refrigeramos hasta el momento de tomar en un recipiente hermético o túper para que el chocolate no se humedezca."
        },
        {
            "liked": false,
            "img": "/frambuesa_y_queso.jpg",
            "name": "Semifrío de frambuesa y queso crema: receta sin horno",
            "description": "Dificultad: Media\nTiempo total 36 m\nElaboración 30 m\nCocción 6 m\nReposo 4 h",
            "ingridientes": "Queso crema (para la mousse de queso) 200 g\nLeche (para la mousse de queso) 50 g\nGelatina en láminas (para la mousse de queso) 5 g\nNata líquida para montar (para la mousse de queso) 20 g\nNata líquida al 35%MG para semimontar (para la mousse de queso) 180 g\nFrambuesas (para la mousse de frambuesa) 250 g\nGelatina en láminas (para la mousse de frambuesa) 6 g\nAzúcar (para la mousse de frambuesa) 20 g\nQueso crema (para la mousse de frambuesa) 50 g\nNata líquida para montar (para la mousse de frambuesa) 200 g",
            "pasos": "Calentamos la nata junto al azúcar hasta que hierva. En un cuenco troceamos el chocolate y vertemos la nata caliente por encima mientras removemos con unas varillas para que el chocolate se deshaga completamente. Agregamos la mantequilla y el cava mezclamos totalmente. Vertemos la mezcla en una bandeja, echamos la frambuesa, removemos y refrigeramos hasta que la masa se haya endurecido (cuanta más delgada sea la superficie antes se enfría). Una vez tengamos la masa cuajada, hacemos bolitas de igual tamaño con una cuchara y damos forma de bolita perfecta con las manos, teniendo cuidado de no dar mucho calor a la masa. Por último rebozamos cada trufa en lo que prefiramos: cacao en polvo, virutas, bolitas de anís, etc. Refrigeramos hasta el momento de tomar en un recipiente hermético o túper para que el chocolate no se humedezca."
        },
        {
            "lined": false,
            "img": "/tarta_de_chocolate.jpg",
            "name": "Tarta de chocolate",
            "description": "Para 8 personas\nDificultad: Fácil\nTiempo total 15 m\nElaboración 5 m\nCocción 10 m",
            "ingridientes": "Galletas tipo Digestive\n200 g\nMantequilla a temperatura ambiente\n100 g\nChocolate negro para postres\n250 g\nLeche entera\n1 l\nCuajada en polvo sobres\n2\nAzúcar\n50 g\nChocolate blanco para decorar\n100 g",
            "pasos": "Trituramos las galletas dentro de una bolsa de plástico bien cerrada y pasando por encima un rodillo. Agregamos la mantequilla a temperatura ambiente o, incluso mejor, ligeramente fundida. Mezclamos bien para obtener una masa homogénea. Cubrimos la base y laterales de un molde desmoldable de 25 cm, aplastando bien para compactar, y guardamos en la nevera o congelador para que endurezca. Mientras tanto preparamos el relleno. Picamos el chocolate y lo calentamos en un cacito junto con la leche, los dos sobres de cuajada y el azúcar durante 10 minutos. Removemos bien para que no queden grumos. Vertemos sobre la base de galletas y dejamos cuajar en la nevera durante cuatro horas aproximadamente. Con un pelador hacemos virutas de chocolate blanco y decoramos la tarta en el momento de servir."
        },
        {
            "lined": false,
            "img": "/vasitos_de_crema_cacahuete_chocolate.jpg",
            "name": "Vasitos de crema de cacahuete y chocolate con leche",
            "description": "Para 8 unidades\nDificultad: Fácil\nTiempo total 1 h 5 m\nElaboración 20 m\nCocción 45 m",
            "ingridientes": "Crema de cacahuete suave 180 g\nChocolate con leche 90 g\nHuevo 1\nYema de huevo 4\nNata líquida para montar 375 ml\nLeche 50 ml\nAzúca 75 g",
            "pasos": "Precalentamos el horno a 165 ºC. Ponemos en un bol grande la crema de cacahuete y el chocolate con leche (si es de pastilla lo troceamos). En otro bol, batimos el huevo con las yemas. Ponemos en un cazo la nata, la leche y el azúcar y calentamos removiendo hasta que el azúcar se haya disuelto y empiece a hervir. Vertemos poco a poco la mezcla de leche sobre los huevos removiendo constantemente para evitar que los huevos se cuajen. Echamos esta mezcla sobre el bol con la crema de cacahuete y el chocolate a través de un colador, esperamos tres o cuatro minutos para que el chocolate se funda. Batimos enérgicamente para mezclarlo todo bien, si vemos que el chocolate no está fundido del todo, calentamos la mezcla en el microondas durante 15 segundos. Repartimos la mezcla en ocho vasitos resistentes al calor. Los ponemos en una fuente de horno grande y la llenamos de agua hasta que alcance la mitad de la altura de los vasitos. La llevamos al horno y horneamos durante unos 40 ó 50 minutos, hasta que solamente se note líquida una pequeña parte en el centro de cada vasito. Los sacamos del horno y los dejamos enfriar a temperatura ambiente, una vez fríos, los guardamos en el frigorífico."
        }
    ]
}
